# DataFrames & Aggregating Data on Dogs Dataset

In [1]:
import numpy as np
import pandas as pd

In [2]:
dogs = pd.read_csv('./datasets/dogs.csv')
dogs

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
4      Max      Labrador   Black           59           29     2017-01-20
5   Stella     Chihuahua     Tan           18            2     2015-04-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [3]:
dogs.head() # First five

      Name       Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella    Labrador   Brown           56           25     2013-07-01
1  Charlie      Poodle   Black           43           23     2016-09-16
2     Lucy        Chow   Brown           46           22     2014-08-25
3   Cooper   Schnauzer    Gray           49           17     2011-12-11
4      Max    Labrador   Black           59           29     2017-01-20

In [4]:
dogs.tail() # Last Five

     Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
2    Lucy          Chow   Brown           46           22     2014-08-25
3  Cooper     Schnauzer    Gray           49           17     2011-12-11
4     Max      Labrador   Black           59           29     2017-01-20
5  Stella     Chihuahua     Tan           18            2     2015-04-20
6  Bernie   St. Bernard   White           77           74      2018-02-2

In [5]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Breed           7 non-null      object
 2    Color          7 non-null      object
 3    Height(cm)     7 non-null      int64
 4    Weight(kg)     7 non-null      int64
 5    Date of Birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

In [6]:
dogs.shape

(7, 6)

In [7]:
dogs.describe()

        Height(cm)   Weight(kg)
count     7.000000     7.000000
mean     49.714286    27.428571
std      17.960274    22.292429
min      18.000000     2.000000
25%      44.500000    19.500000
50%      49.000000    23.000000
75%      57.500000    27.000000
max      77.000000    74.000000

In [8]:
dogs.values

array([['Bella', ' Labrador', ' Brown', 56, 25, ' 2013-07-01'],
       ['Charlie', ' Poodle', ' Black', 43, 23, ' 2016-09-16'],
       ['Lucy', ' Chow', ' Brown', 46, 22, ' 2014-08-25'],
       ['Cooper', ' Schnauzer', ' Gray', 49, 17, ' 2011-12-11'],
       ['Max', ' Labrador', ' Black', 59, 29, ' 2017-01-20'],
       ['Stella', ' Chihuahua', ' Tan', 18, 2, ' 2015-04-20'],
       ['Bernie', ' St. Bernard', ' White', 77, 74, ' 2018-02-2']],
      dtype=object)

In [9]:
dogs.columns

Index(['Name', 'Breed', ' Color', ' Height(cm)', ' Weight(kg)',
       ' Date of Birth'],
      dtype='object')

In [10]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

### Sorting

In [11]:
dogs.sort_values(by=' Height(cm)')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [12]:
dogs.sort_values(by=' Height(cm)', ascending='False')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [13]:
dogs.sort_values(by=' Weight(kg)')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
2     Lucy          Chow   Brown           46           22     2014-08-25
1  Charlie        Poodle   Black           43           23     2016-09-16
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [14]:
dogs.sort_values(by=' Weight(kg)', ascending='False')

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
2     Lucy          Chow   Brown           46           22     2014-08-25
1  Charlie        Poodle   Black           43           23     2016-09-16
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [15]:
dogs.sort_values(['Name', ' Date of Birth'])

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
6   Bernie   St. Bernard   White           77           74      2018-02-2
1  Charlie        Poodle   Black           43           23     2016-09-16
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
2     Lucy          Chow   Brown           46           22     2014-08-25
4      Max      Labrador   Black           59           29     2017-01-20
5   Stella     Chihuahua     Tan           18            2     2015-04-20

In [16]:
dogs.sort_values(['Name', ' Date of Birth'], ascending=[False,False])

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
4      Max      Labrador   Black           59           29     2017-01-20
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
1  Charlie        Poodle   Black           43           23     2016-09-16
6   Bernie   St. Bernard   White           77           74      2018-02-2
0    Bella      Labrador   Brown           56           25     2013-07-01

In [17]:
dogs.sort_values([' Height(cm)', ' Color'], ascending=[True,False])

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
5   Stella     Chihuahua     Tan           18            2     2015-04-20
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

### Subsetting

In [18]:
dogs['Name']

0      Bella
1    Charlie
2       Lucy
3     Cooper
4        Max
5     Stella
6     Bernie
Name: Name, dtype: object

In [19]:
dogs[["Name"," Date of Birth"," Color"]]

      Name  Date of Birth   Color
0    Bella     2013-07-01   Brown
1  Charlie     2016-09-16   Black
2     Lucy     2014-08-25   Brown
3   Cooper     2011-12-11    Gray
4      Max     2017-01-20   Black
5   Stella     2015-04-20     Tan
6   Bernie      2018-02-2   White

In [20]:
dogs[' Weight(kg)'] > 20

0     True
1     True
2     True
3    False
4     True
5    False
6     True
Name:  Weight(kg), dtype: bool

In [21]:
dogs[dogs[' Weight(kg)']> 20]

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
4      Max      Labrador   Black           59           29     2017-01-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

In [22]:
dogs[dogs['Breed'] == ' Labrador']

    Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0  Bella   Labrador   Brown           56           25     2013-07-01
4    Max   Labrador   Black           59           29     2017-01-20

In [23]:
Weight = dogs[" Weight(kg)"] > 20
Color = dogs[" Color"]==" Brown"
dogs[Weight & Color]

    Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0  Bella   Labrador   Brown           56           25     2013-07-01
2   Lucy       Chow   Brown           46           22     2014-08-25

In [24]:
dogs[' Color'].isin([" Black"," White"])

0    False
1     True
2    False
3    False
4     True
5    False
6     True
Name:  Color, dtype: bool

## Creating new Columns

In [25]:
dogs[' Weight(pounds)'] = dogs[' Weight(kg)'] / 0.45359237
dogs

# 1 kilogram (kg) is equal to 2.20462262185 pounds (lbs).

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Weight(pounds)
0,Bella,Labrador,Brown,56,25,2013-07-01,55.115566
1,Charlie,Poodle,Black,43,23,2016-09-16,50.706320
2,Lucy,Chow,Brown,46,22,2014-08-25,48.501698
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,37.478585
4,Max,Labrador,Black,59,29,2017-01-20,63.934056
5,Stella,Chihuahua,Tan,18,2,2015-04-20,4.409245
6,Bernie,St. Bernard,White,77,74,2018-02-2,163.142074

## Aggregating Data

In [26]:
dogs[' Weight(pounds)'].mean()

60.46964905642356

In [27]:
dogs[' Weight(pounds)'].mode()

0      4.409245
1     37.478585
2     48.501698
3     50.706320
4     55.115566
5     63.934056
6    163.142074
dtype: float64

In [28]:
dogs[' Weight(pounds)'].median()

50.70632030252184

In [29]:
dogs[' Weight(pounds)'].min()

4.409245243697551

In [30]:
dogs[' Weight(pounds)'].max()

163.1420740168094

In [31]:
dogs[' Weight(pounds)'].var()

2415.367923912013

In [32]:
dogs[' Weight(pounds)'].quantile()

50.70632030252184

In [33]:
dogs[' Weight(pounds)'].std()

49.146392786368494

In [34]:
dogs[' Weight(pounds)'].sum()

423.2875433949649

## Summarizing dates

In [35]:
dogs[' Date of Birth'].min()

' 2011-12-11'

## .agg() method

### Single Column

In [36]:
def pct30(column):return column.quantile(0.3)

In [37]:
dogs[' Weight(pounds)'].agg(pct30)

46.29707505882429

In [38]:
dogs[' Weight(pounds)'].agg(lambda col : col.quantile(.3))

46.29707505882429

### Multiple Columns

In [39]:
dogs[[' Height(cm)', ' Weight(kg)', ' Weight(pounds)']].agg(lambda x: x.quantile(0.3))

 Height(cm)        45.400000
 Weight(kg)        21.000000
 Weight(pounds)    46.297075
dtype: float64

### Multiple summaries

In [40]:
def pct40(column):return column.quantile(0.4)

In [41]:
dogs[' Weight(pounds)'].agg([pct30,pct40])

pct30    46.297075
pct40    49.383547
Name:  Weight(pounds), dtype: float64

## Cumulative statistics

In [42]:
pd.DataFrame(dogs[' Weight(pounds)'].cumsum())

    Weight(pounds)
0        55.115566
1       105.821886
2       154.323584
3       191.802168
4       255.736224
5       260.145469
6       423.287543

In [43]:
pd.DataFrame(dogs[' Weight(pounds)'].cummax())

    Weight(pounds)
0        55.115566
1        55.115566
2        55.115566
3        55.115566
4        63.934056
5        63.934056
6       163.142074

In [44]:
pd.DataFrame(dogs[' Weight(pounds)'].cummin())

    Weight(pounds)
0        55.115566
1        50.706320
2        48.501698
3        37.478585
4        37.478585
5         4.409245
6         4.409245

## Dropping duplicate

In [45]:
dogs

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Weight(pounds)
0,Bella,Labrador,Brown,56,25,2013-07-01,55.115566
1,Charlie,Poodle,Black,43,23,2016-09-16,50.706320
2,Lucy,Chow,Brown,46,22,2014-08-25,48.501698
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,37.478585
4,Max,Labrador,Black,59,29,2017-01-20,63.934056
5,Stella,Chihuahua,Tan,18,2,2015-04-20,4.409245
6,Bernie,St. Bernard,White,77,74,2018-02-2,163.142074

In [46]:
dogs.drop_duplicates(subset = "Breed")

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Weight(pounds)
0,Bella,Labrador,Brown,56,25,2013-07-01,55.115566
1,Charlie,Poodle,Black,43,23,2016-09-16,50.706320
2,Lucy,Chow,Brown,46,22,2014-08-25,48.501698
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,37.478585
5,Stella,Chihuahua,Tan,18,2,2015-04-20,4.409245
6,Bernie,St. Bernard,White,77,74,2018-02-2,163.142074

In [47]:
dogs.drop_duplicates(subset = [" Color", "Breed"])

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,Weight(pounds)
0,Bella,Labrador,Brown,56,25,2013-07-01,55.115566
1,Charlie,Poodle,Black,43,23,2016-09-16,50.706320
2,Lucy,Chow,Brown,46,22,2014-08-25,48.501698
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,37.478585
4,Max,Labrador,Black,59,29,2017-01-20,63.934056
5,Stella,Chihuahua,Tan,18,2,2015-04-20,4.409245
6,Bernie,St. Bernard,White,77,74,2018-02-2,163.142074

### .values_count()

In [48]:
pd.DataFrame(dogs[' Color'].value_counts()) # Sort by Default True

         Color
 Brown       2
 Black       2
 Tan         1
 White       1
 Gray        1

In [49]:
pd.DataFrame(dogs[' Color'].value_counts(sort= False))

         Color
 Gray        1
 Black       2
 White       1
 Brown       2
 Tan         1

In [50]:
pd.DataFrame(dogs[' Color'].value_counts(normalize=True))

           Color
 Brown  0.285714
 Black  0.285714
 Tan    0.142857
 White  0.142857
 Gray   0.142857

## Group summary satistics

In [51]:
dogs[dogs[' Color'] == ' Black'][' Weight(pounds)'].mean()

57.32018816806817

In [52]:
dogs[dogs[' Color'] == ' Brown'][' Weight(pounds)'].mean()

51.80863161344623

In [53]:
dogs.groupby(' Color')[' Weight(pounds)'].mean()

 Color
 Black     57.320188
 Brown     51.808632
 Gray      37.478585
 Tan        4.409245
 White    163.142074
Name:  Weight(pounds), dtype: float64

In [54]:
pd.DataFrame(dogs.groupby(' Color')[' Weight(pounds)'].mean())

         Weight(pounds)
 Color
 Black        57.320188
 Brown        51.808632
 Gray         37.478585
 Tan           4.409245
 White       163.142074

In [55]:
dogs.groupby([' Color', 'Breed'])[' Weight(pounds)'].count() # < -- multiple group

 Color  Breed
 Black   Labrador       1
         Poodle         1
 Brown   Chow           1
         Labrador       1
 Gray    Schnauzer      1
 Tan     Chihuahua      1
 White   St. Bernard    1
Name:  Weight(pounds), dtype: int64

In [56]:
dogs.groupby(' Color')[' Weight(kg)'].agg(['count', 'min', 'max'])# <-- multiple stats

        count  min  max
 Color
 Black      2   23   29
 Brown      2   22   25
 Gray       1   17   17
 Tan        1    2    2
 White      1   74   74

## Pivot Tables

In [57]:
#pivot and implicitly define agffunc=np.mean
dogs.pivot_table(values = ' Weight(kg)', index='Name')

          Weight(kg)
Name
Bella             25
Bernie            74
Charlie           23
Cooper            17
Lucy              22
Max               29
Stella             2

In [58]:
#explicitly define statistics i:e np.median
dogs.pivot_table(values= ' Weight(kg)', index=' Color', aggfunc=np.median)

         Weight(kg)
 Color
 Black         26.0
 Brown         23.5
 Gray          17.0
 Tan            2.0
 White         74.0

In [59]:
dogs.pivot_table(values= ' Weight(kg)', index=' Color', aggfunc=[np.median,np.std])

            median         std
        Weight(kg)  Weight(kg)
 Black        26.0    4.242641
 Brown        23.5    2.121320
 Gray         17.0         NaN
 Tan           2.0         NaN
 White        74.0         NaN

In [60]:
#pivot on two varibales
dogs.pivot_table(values=' Weight(kg)', index=' Color', columns='Breed')

Breed    Chihuahua   Chow   Labrador   Poodle   Schnauzer   St. Bernard
 Color
 Black         NaN    NaN       29.0     23.0         NaN           NaN
 Brown         NaN   22.0       25.0      NaN         NaN           NaN
 Gray          NaN    NaN        NaN      NaN        17.0           NaN
 Tan           2.0    NaN        NaN      NaN         NaN           NaN
 White         NaN    NaN        NaN      NaN         NaN          74.0

In [61]:
dogs.pivot_table(values=' Weight(kg)', index=' Color', columns='Breed', fill_value= 0)

Breed    Chihuahua   Chow   Labrador   Poodle   Schnauzer   St. Bernard
 Color
 Black           0      0         29       23           0             0
 Brown           0     22         25        0           0             0
 Gray            0      0          0        0          17             0
 Tan             2      0          0        0           0             0
 White           0      0          0        0           0            74

### summing with pivot table

In [62]:
dogs.pivot_table(values=' Weight(kg)', 
                    index=' Color', 
                    columns='Breed',
                    fill_value=0,
                    margins=True)

Breed    Chihuahua   Chow   Labrador   Poodle   Schnauzer   St. Bernard   All
 Color
 Black           0      0         29       23           0             0  26.0
 Brown           0     22         25        0           0             0  23.5
 Gray            0      0          0        0          17             0  17.0
 Tan             2      0          0        0           0             0   2.0
 White           0      0          0        0           0            74  74.0
All              2     22         27       23          17            74  27.0

In [63]:
dogs.pivot_table(values=' Weight(kg)', 
                    index=' Color', 
                    columns='Breed',
                    fill_value=0,
                    margins=True,
                    margins_name= 'Total Mean')

Breed,Chihuahua,Chow,Labrador,Poodle,Schnauzer,St. Bernard,Total Mean
Color,,,,,,,
Black,0,0,29,23,0,0,26.0
Brown,0,22,25,0,0,0,23.5
Gray,0,0,0,0,17,0,17.0
Tan,2,0,0,0,0,0,2.0
White,0,0,0,0,0,74,74.0
Total Mean,2,22,27,23,17,74,27.0